9/data/attachments/32f8aed88dbaf04e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_a2f52e87-e0b5-4f03-88b9-e00689416176</nif:username>
            <nif:friendToBeAdded>Aaron_purpose_Actions_84126_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>